# Даны два комплексных числа. Напишите программу, которая вычисляет и выводит их сумму, разность и произведение.
#
# Формат входных данных
# На вход программе подается два комплексных числа, каждое на отдельной строке.
#
# Формат выходных данных
# Программа должна вывести ответ на задачу.
#
# Sample Input 1:
#
# 1+2j
# -2+4j
# Sample Output 1:
#
# (1+2j) + (-2+4j) = (-1+6j)
# (1+2j) - (-2+4j) = (3-2j)
# (1+2j) * (-2+4j) = (-10+0j)
#
# from cmath import *
# # a, b = complex(int(input())), complex(int(input()))
# a = complex(input())
# b = complex(input())
# print(f"{a} + {b} = {a + b}")
# print(f"{a} - {b} = {a - b}")
# print(f"{a} * {b} = {a * b}")
# __________________
# a = input()
# b = input()
# for i in "+-*":
#     print(f"({a}) {i} ({b}) =",  eval(f"({a}){i}({b})"))
# ______________________________________________________________________

# Комплексные числа хранятся в списке numbers. Дополните приведенный код так, чтобы он вывел комплексное число с наибольшим модулем и сам модуль числа на отдельных строках.
#
# Примечание. Модуль комплексного числа можно вычислить с помощью встроенной функции abs().
# from operator import itemgetter
# numbers = [3 + 4j, 3 + 1j, -7 + 3j, 4 + 8j, -8 + 10j, -3 + 2j, 3 - 2j, -9 + 9j, -1 - 1j, -1 - 10j, -20 + 15j, -21 + 1j, 1j, -3 + 8j, 4 - 6j, 8 + 2j, 2 + 3j]
# # n1 = [set(i) for i in numbers]
# n = [abs(i) for i in numbers]
# a = sorted(n)[-1]
# ind = n.index(a)
# print(numbers[ind])
# print(a)
# ____________
#
# numbers = [3+4j, 3+1j, -7+3j, 4+8j, -8+10j, -3+2j, 3-2j, -9+9j, -1-1j, -1-10j, -20+15j, -21+1j, 1j, -3+8j, 4-6j, 8+2j, 2+3j]
#
# largest = max((abs(i), i) for i in numbers)
#
# print(largest[1], largest[0], sep='\n')

# ___________________________________________________________________________
# Дано натуральное число nn и два комплексных числа . Напишите программу, которая вычисляет и выводит значение выражения
from cmath import *
n = int(input())
a = complex(input())
b = complex(input())
print((a**n) + (b**n) + (a.conjugate()** n) + (b.conjugate()** (n +1)))